submission_logs/2_2_two_middlewares/64/4/0-1/2/memtier/5.log
1         Threads
4         Connections per thread
80        Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec 
------------------------------------------------------------------------
Sets           0.00          ---          ---      0.00000         0.00 
Gets         474.38       469.88         4.50      8.42600      1903.39 
Waits          0.00          ---          ---      0.00000          --- 
Totals       474.38       469.88         4.50      8.42600      1903.39 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
---
GET       1.300         0.02
GET       1.400         0.10
GET       1.500         0.48
GET       1.600         1.41
GET       1.700         3.23
GET       1.800         6.02
GET       1.900         9.50
GET       2.000        13.63
GET       2.100        18.24
GET       2.200        22.38
GET       2.300        26.38
GET       2.400        29.72
GET       2.500        32.47
GET       2.600        34.51
GET       2.700        36.19
GET       2.800        37.44
GET       2.900        38.36
GET       3.000        39.14
GET       3.100        39.72
GET       3.200        40.21
GET       3.300        40.65
GET       3.400        41.02
GET       3.500        41.33
GET       3.600        41.65
GET       3.700        41.93
GET       3.800        42.15
GET       3.900        42.38
GET       4.000        42.60
GET       4.100        42.75
GET       4.200        42.93
GET       4.300        43.09
GET       4.400        43.21
GET       4.500        43.34
GET       4.600        43.41
GET       4.700        43.49
GET       4.800        43.59
GET       4.900        43.69
GET       5.000        43.77
GET       5.100        43.85
GET       5.200        43.94
GET       5.300        43.99
GET       5.400        44.07
GET       5.500        44.17
GET       5.600        44.26
GET       5.700        44.37
GET       5.800        44.46
GET       5.900        44.53
GET       6.000        44.61
GET       6.100        44.70
GET       6.200        44.78
GET       6.300        44.90
GET       6.400        44.99
GET       6.500        45.13
GET       6.600        45.29
GET       6.700        45.44
GET       6.800        45.56
GET       6.900        45.70
GET       7.000        45.83
GET       7.100        46.06
GET       7.200        46.27
GET       7.300        46.49
GET       7.400        46.70
GET       7.500        46.93
GET       7.600        47.14
GET       7.700        47.35
GET       7.800        47.53
GET       7.900        47.71
GET       8.000        47.91
GET       8.100        48.07
GET       8.200        48.23
GET       8.300        48.38
GET       8.400        48.54
GET       8.500        48.69
GET       8.600        48.85
GET       8.700        49.01
GET       8.800        49.17
GET       8.900        49.38
GET       9.000        49.58
GET       9.100        49.74
GET       9.200        49.92
GET       9.300        50.15
GET       9.400        50.34
GET       9.500        50.49
GET       9.600        50.62
GET       9.700        50.79
GET       9.800        50.93
GET       9.900        51.08
GET      10.000        51.86
GET      11.000        53.49
GET      12.000        56.65
GET      13.000        74.08
GET      14.000        88.01
GET      15.000        93.85
GET      16.000        98.29
GET      17.000        98.63
GET      18.000        98.88
GET      19.000        99.13
GET      20.000        99.29
GET      21.000        99.39
GET      22.000        99.49
GET      23.000        99.52
GET      24.000        99.56
GET      25.000        99.59
GET      26.000        99.60
GET      27.000        99.65
GET      28.000        99.79
GET      29.000        99.86
GET      30.000        99.91
GET      31.000        99.91
GET      32.000        99.92
GET      34.000        99.93
GET      37.000        99.93
GET      38.000        99.95
GET      39.000        99.96
GET      40.000        99.97
GET      45.000        99.97
GET      46.000        99.97
GET      47.000        99.99
GET      50.000        99.99
GET      51.000       100.00
GET     190.000       100.00
---